
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанных = Параметры.АдресДанных;
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресДанных);
	ЗаполнитьГрафик(ТаблицаДанных);
	
КонецПроцедуры 



&НаСервере
Процедура ЗаполнитьГрафик(ТаблицаДанных)
	
	АнализГрафика.Очистить();	
	
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Точка = АнализГрафика.УстановитьТочку(СтрокаТЗ.Сотрудник);
		Серия = АнализГрафика.УстановитьСерию(СтрокаТЗ.КоличествоДней);
		Серия.Текст = "Отпуск";
		
		Значение = АнализГрафика.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = СтрокаТЗ.ДатаНачала;
		Интервал.Конец = СтрокаТЗ.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры
