
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрокаТЗ Из ОтпускаСотрудников Цикл
		Если СтрокаТЗ.ДатаНачала > СтрокаТЗ.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю("ДатаНачала не может быть позднее ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	ВыделитьСтрокиЕслиОтпускБолее28Дней();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыделитьСтрокиЕслиОтпускБолее28Дней() Экспорт
	
	ТаблицаДанных = ЭтотОбъект.ОтпускаСотрудников.Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		СтрокаТЗ.КоличествоДней = ((СтрокаТЗ.ДатаОкончания - СтрокаТЗ.ДатаНачала) / 86400) + 1;
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Сотрудник", "КоличествоДней");
	
	Для Каждого Строка Из ЭтотОбъект.ОтпускаСотрудников Цикл
		Строка.Более28Дней = Ложь;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Если СтрокаТЗ.КоличествоДней <= 28 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", СтрокаТЗ.Сотрудник);
		
		СтрокиСотрудник = ЭтотОбъект.ОтпускаСотрудников.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаСотрудник Из СтрокиСотрудник Цикл 
			СтрокаФормы = ЭтотОбъект.ОтпускаСотрудников.Получить(СтрокаСотрудник.НомерСтроки - 1);
			СтрокаФормы.Более28Дней = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

