
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ДобавитьПоляФормыДляАбонентскогоДоговора();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидАбонентскоеОбслуживание = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание"); 
	
	Если Объект.ВидДоговора = ВидАбонентскоеОбслуживание Тогда
		ДобавитьПоляФормыДляАбонентскогоДоговора();
	Иначе		
		УдалитьПоляФормыДляАбонентскогоДоговора();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ДобавитьГруппуЭлементыАбонентскогоДоговора()
	
	Группа = Элементы.Добавить("ГруппаЭлементыАбонентскогоДоговора", Тип("ГруппаФормы"), ЭтаФорма);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Дополнительные реквизиты Абонентского договора";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуПериодДействия()
	
	Группа = Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"), Элементы.ГруппаЭлементыАбонентскогоДоговора);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Заголовок = "Период действия";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуАбонПлатаИСтоимостьЧаса()
	
	Группа = Элементы.Добавить("ГруппаАбонПлатаИСтоимостьЧаса", Тип("ГруппаФормы"), Элементы.ГруппаЭлементыАбонентскогоДоговора);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеНачалоПериодаДействия()
	
	ПолеВвода = Элементы.Добавить("НачалоПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоПериодаДействия";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеОкончаниеПериодаДействия()
	
	ПолеВвода = Элементы.Добавить("ОкончаниеПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеПериодаДействия";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеАбонентскаяПлата()
	
	ПолеВвода = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), Элементы.ГруппаАбонПлатаИСтоимостьЧаса);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеСтоимостьЧаса()
	
	ПолеВвода = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"), Элементы.ГруппаАбонПлатаИСтоимостьЧаса);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Насервере
Процедура ДобавитьПоляФормыДляАбонентскогоДоговора()
	
	ДобавитьГруппуЭлементыАбонентскогоДоговора();
	ДобавитьГруппуПериодДействия();
	ДобавитьГруппуАбонПлатаИСтоимостьЧаса();
	ДобавитьПолеНачалоПериодаДействия();
	ДобавитьПолеОкончаниеПериодаДействия();
	ДобавитьПолеАбонентскаяПлата();
	ДобавитьПолеСтоимостьЧаса()
	
КонецПроцедуры

&Насервере
Процедура УдалитьПоляФормыДляАбонентскогоДоговора()
	
	ГруппаЭлементыАбонентскогоДоговора = Элементы.Найти("ГруппаЭлементыАбонентскогоДоговора");
	
	Если ГруппаЭлементыАбонентскогоДоговора = Неопределено Тогда
		Возврат;
	Иначе
		Элементы.Удалить(ГруппаЭлементыАбонентскогоДоговора);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти


